app/views/articles/show.html.erb

<h2>Комментарии</h2>
<% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]