app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "455555y"], ["updated_at", "2016-06-29 12:40:05.031428"], ["id", 1]]
---
  def update
   @article = Article.find(params[:id])
    if @article.update(article_params)