app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "vlabster"], ["body", "qweqw"], ["article_id", 1], ["created_at", "2016-06-29 15:19:19.380445"], ["updated_at", "2016-06-29 15:19:19.380445"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)